duxinglang-1/nRF9160_test/E2_SERCO/src/uart_ble/uart_ble.c
	gpio_pin_write(gpio_ble, BLE_WAKE_PIN, 1);
	k_sleep(K_MSEC(10));
	gpio_pin_write(gpio_ble, BLE_WAKE_PIN, 0);
}

//xb add 2021-11-01 唤醒52810的串口需要时间，不能直接在接收的中断里延时等待，防止重启
void uart_send_data_handle(void)
{
	switch(uart_data_type)
	{
	case DATA_TYPE_BLE:
		ble_wakeup_nrf52810();
	#ifdef CONFIG_WIFI
		switch_to_ble();
	#endif	
		break;

	case DATA_TYPE_WIFI:
	#ifdef CONFIG_WIFI
		switch_to_ble();
	#endif	
		
		break;
	}

#ifdef CONFIG_DEVICE_POWER_MANAGEMENT
	uart_sleep_out(UART_PERIPHERAL);
#endif

	uart_fifo_fill(uart_ble, tx_buf, send_len);
	uart_irq_tx_enable(uart_ble); 	
}

void ble_send_date_handle(u8_t *buf, u32_t len)
{
#ifdef UART_DEBUG
	LOGD("begin");
#endif

	send_len = len;
	memcpy(tx_buf, buf, len);
	
	uart_data_type = DATA_TYPE_BLE;
	uart_send_flag = true;
}

#ifdef CONFIG_WIFI
void wifi_send_data_handle(u8_t *buf, u32_t len)
{
#ifdef UART_DEBUG
	LOGD("cmd:%s", buf);
#endif

#ifdef CONFIG_DEVICE_POWER_MANAGEMENT
	uart_sleep_out(UART_PERIPHERAL);
#endif

	switch_to_wifi();

	uart_fifo_fill(uart_ble, buf, len);
	uart_irq_tx_enable(uart_ble);
}
#endif

static void uart_receive_data(u8_t data, u32_t datalen)
{
	static u32_t data_len = 0;

#ifdef UART_DEBUG
	//LOGD("rece_len:%d, data_len:%d data:%x", rece_len, data_len, data);
#endif

#ifdef CONFIG_DEVICE_POWER_MANAGEMENT
	if(!uart_ble_is_waked)
		return;
#endif

    if(blue_is_on)
    {
    	if((rece_len == 0) && (data != PACKET_HEAD))
			return;
		
        rx_buf[rece_len++] = data;
		if(rece_len == 3)
			data_len = (256*rx_buf[1]+rx_buf[2]+3);
		
        if(rece_len == data_len)	
        {
            ble_receive_data_handle(rx_buf, rece_len);
            
            memset(rx_buf, 0, sizeof(rx_buf));
            rece_len = 0;
			data_len = 0;
        }
		else if((rece_len >= data_len)&&(data == PACKET_END))
        {
            memset(rx_buf, 0, sizeof(rx_buf));
            rece_len = 0;
			data_len = 0;
        }
		else if(rece_len >= BUF_MAXSIZE)
		{
			memset(rx_buf, 0, sizeof(rx_buf));
            rece_len = 0;
			data_len = 0;
		}		
    }
#ifdef CONFIG_WIFI	
    else if(wifi_is_on)
    {
        rx_buf[rece_len++] = data;

        if((rx_buf[rece_len-2] == 0x4F) && (rx_buf[rece_len-1] == 0x4B))	//"OK"
        {
        	wifi_receive_data_handle(rx_buf, rece_len);
			
            memset(rx_buf, 0, sizeof(rx_buf));
            rece_len = 0;
        }
		else if(rece_len == BUF_MAXSIZE)
		{
			memset(rx_buf, 0, sizeof(rx_buf));
            rece_len = 0;
		}
   }
#endif	
}

void uart_send_data(void)
{
#ifdef UART_DEBUG
	LOGD("begin");
#endif

	uart_fifo_fill(uart_ble, "Hello World!", strlen("Hello World!"));
	uart_irq_tx_enable(uart_ble); 
}

static void uart_cb(struct device *x)
{
	u8_t tmpbyte = 0;
	u32_t len=0;

	uart_irq_update(x);

	if(uart_irq_rx_ready(x)) 
	{
		while((len = uart_fifo_read(x, &tmpbyte, 1)) > 0)
			uart_receive_data(tmpbyte, 1);
	}
	
	if(uart_irq_tx_ready(x))
	{
		struct uart_data_t *buf;
		u16_t written = 0;

		buf = k_fifo_get(&fifo_uart_tx_data, K_NO_WAIT);
		/* Nothing in the FIFO, nothing to send */
		if(!buf)
		{
			uart_irq_tx_disable(x);
			return;
		}

		while(buf->len > written)
		{
			written += uart_fifo_fill(x, &buf->data[written], buf->len - written);
		}

		while (!uart_irq_tx_complete(x))
		{
			/* Wait for the last byte to get
			* shifted out of the module
			*/
		}

		if (k_fifo_is_empty(&fifo_uart_tx_data))
		{
			uart_irq_tx_disable(x);
		}

		k_free(buf);
	}
}

#ifdef CONFIG_DEVICE_POWER_MANAGEMENT
void uart_log_sleep_out(void)
{
	if(k_timer_remaining_get(&uart_log_sleep_in_timer) > 0)
		k_timer_stop(&uart_log_sleep_in_timer);
	k_timer_start(&uart_log_sleep_in_timer, K_SECONDS(UART_LOG_WAKE_HOLD_TIME_SEC), NULL);

	if(uart_log_is_waked)
		return;

	device_set_power_state(uart_log, DEVICE_PM_ACTIVE_STATE, NULL, NULL);
	k_sleep(K_MSEC(10));
	uart_log_is_waked = true;

#ifdef UART_DEBUG
	LOGD("uart log set active success!");
#endif
}

void uart_log_sleep_in(void)
{	
	if(!uart_log_is_waked)
		return;

	device_set_power_state(uart_log, DEVICE_PM_LOW_POWER_STATE, NULL, NULL);
	k_sleep(K_MSEC(10));
	uart_log_is_waked = false;

#ifdef UART_DEBUG
	LOGD("uart log set low power success!");
#endif
}

void uart_ble_sleep_out(void)
{
	if(k_timer_remaining_get(&uart_ble_sleep_in_timer) > 0)
		k_timer_stop(&uart_ble_sleep_in_timer);
	k_timer_start(&uart_ble_sleep_in_timer, K_SECONDS(UART_BLE_WAKE_HOLD_TIME_SEC), NULL);

	if(uart_ble_is_waked)
		return;

	device_set_power_state(uart_ble, DEVICE_PM_ACTIVE_STATE, NULL, NULL);
	k_sleep(K_MSEC(10));	
	uart_ble_is_waked = true;

#ifdef UART_DEBUG
	LOGD("uart ble set active success!");
#endif
}

void uart_ble_sleep_in(void)
{	
	if(!uart_ble_is_waked)
		return;

	device_set_power_state(uart_ble, DEVICE_PM_LOW_POWER_STATE, NULL, NULL);
	k_sleep(K_MSEC(10));
	uart_ble_is_waked = false;

#ifdef UART_DEBUG
	LOGD("uart ble set low power success!");
#endif
}

void uart_sleep_out(ENUM_UART_TYPE flag)
{
	switch(flag)
	{
	case UART_MODEM:
		uart_log_sleep_out();
		break;

	case UART_PERIPHERAL:
		uart_ble_sleep_out();
		break;
	}
}

void uart_sleep_in(ENUM_UART_TYPE flag)
{
	switch(flag)
	{
	case UART_MODEM:
		uart_log_sleep_in();
		break;

	case UART_PERIPHERAL:
		uart_ble_sleep_in();
		break;
	}
}

static void ble_interrupt_event(struct device *interrupt, struct gpio_callback *cb, u32_t pins)
{
#ifdef UART_DEBUG
	LOGD("begin");
#endif
	uart_ble_wake_flag = true;
}


static void UartLogSleepInCallBack(struct k_timer *timer_id)
{
#ifdef UART_DEBUG
	LOGD("begin");
#endif
	uart_log_sleep_flag = true;
}

static void UartBleSleepInCallBack(struct k_timer *timer_id)
{
#ifdef UART_DEBUG
	LOGD("begin");
#endif
	uart_ble_sleep_flag = true;
}
#endif/*CONFIG_DEVICE_POWER_MANAGEMENT*/

static void GetBLEInfoCallBack(struct k_timer *timer_id)
{
	get_ble_info_flag = true;
}

void ble_init(void)
{
	int flag = GPIO_DIR_IN|GPIO_INT|GPIO_INT_EDGE|GPIO_PUD_PULL_DOWN|GPIO_INT_ACTIVE_HIGH|GPIO_INT_DEBOUNCE;
#ifdef UART_DEBUG
	LOGD("begin");
#endif

#ifdef CONFIG_DEVICE_POWER_MANAGEMENT
	uart_log = device_get_binding("UART_0");
	if(uart_log)
		k_timer_start(&uart_log_sleep_in_timer, K_SECONDS(3*CONFIG_LTE_NETWORK_TIMEOUT), NULL);
#endif

