duxinglang-1/nRF9160_test/E2_SERCO/src/uart_ble/uart_ble.c
	uart_ble = device_get_binding(BLE_DEV);
	if(!uart_ble)
	{
	#ifdef UART_DEBUG
		LOGD("Could not get %s device", BLE_DEV);
	#endif
		return;
	}

	uart_irq_callback_set(uart_ble, uart_cb);
	uart_irq_rx_enable(uart_ble);

#ifdef CONFIG_WIFI
	wifi_disable();
	switch_to_ble();
#endif

	gpio_ble = device_get_binding(BLE_PORT);
	if(!gpio_ble)
	{
	#ifdef UART_DEBUG
		LOGD("Could not get %s port", BLE_PORT);
	#endif
		return;
	}	
	gpio_pin_configure(gpio_ble, BLE_WAKE_PIN, GPIO_DIR_OUT);
	gpio_pin_write(gpio_ble, BLE_WAKE_PIN, 0);

#ifdef CONFIG_DEVICE_POWER_MANAGEMENT
	gpio_pin_configure(gpio_ble, BLE_INT_PIN, flag);
	gpio_pin_disable_callback(gpio_ble, BLE_INT_PIN);
	gpio_init_callback(&gpio_cb, ble_interrupt_event, BIT(BLE_INT_PIN));
	gpio_add_callback(gpio_ble, &gpio_cb);
	gpio_pin_enable_callback(gpio_ble, BLE_INT_PIN);
	k_timer_start(&uart_ble_sleep_in_timer, K_SECONDS(UART_BLE_WAKE_HOLD_TIME_SEC), NULL);
#endif

	k_timer_start(&get_ble_info_timer, K_SECONDS(2), NULL);
}

void UartMsgProc(void)
{
#ifdef CONFIG_DEVICE_POWER_MANAGEMENT
	if(uart_log_wake_flag)
	{
	#ifdef UART_DEBUG
		LOGD("uart_wake!");
	#endif
		uart_log_wake_flag = false;
		uart_log_sleep_out();
	}

	if(uart_log_sleep_flag)
	{
	#ifdef UART_DEBUG
		LOGD("uart_sleep!");
	#endif
		uart_log_sleep_flag = false;
		uart_log_sleep_in();
	}

	if(uart_ble_wake_flag)
	{
		uart_ble_wake_flag = false;
		uart_ble_sleep_out();
	}

	if(uart_ble_sleep_flag)
	{
		uart_ble_sleep_flag = false;
		uart_ble_sleep_in();
	}
#endif/*CONFIG_DEVICE_POWER_MANAGEMENT*/

	if(uart_send_flag)
	{
		uart_send_data_handle();
		uart_send_flag = false;
	}
	if(redraw_blt_status_flag)
	{
		IdleShowBleStatus(g_ble_connected);
		redraw_blt_status_flag = false;
	}
	if(get_ble_info_flag)
	{
		static u8_t index = 0;

		if(index == 0)
		{
			index = 1;
			MCU_get_nrf52810_ver();
			k_timer_start(&get_ble_info_timer, K_MSEC(100), NULL);
		}
		else
		{
			MCU_get_ble_mac_address();
		}
		
		get_ble_info_flag = false;
	}
}

void test_uart_ble(void)
{
#ifdef UART_DEBUG
	LOGD("begin");
#endif

	while(1)
	{
		ble_send_date_handle("Hello World!\n", strlen("Hello World!\n"));
		k_sleep(K_MSEC(1000));
	}
}
